In [2]:
import pandas as pd
import numpy as np

# Indexing, Slicing and Filtering in Pandas

## Series

In [4]:
data = pd.Series(np.arange(6),index = list('abcdef'))
data

a    0
b    1
c    2
d    3
e    4
f    5
dtype: int32

In [5]:
data['c']

2

In [6]:
data[['c','d']]

c    2
d    3
dtype: int32

In [8]:
data['c':'f']

c    2
d    3
e    4
f    5
dtype: int32

In [9]:
data[4]

4

In [10]:
data[1:4]

b    1
c    2
d    3
dtype: int32

In [11]:
data > 3

a    False
b    False
c    False
d    False
e     True
f     True
dtype: bool

In [12]:
data[data > 3]

e    4
f    5
dtype: int32

## Dataframe

In [13]:
data_dict = {'names':['vikas','akash','kaash','raash'],
            'marks':[50,55,20,30],
            'salary':[100,200,150,105]}
data_dict

{'names': ['vikas', 'akash', 'kaash', 'raash'],
 'marks': [50, 55, 20, 30],
 'salary': [100, 200, 150, 105]}

In [14]:
data2 = pd.DataFrame(data_dict)
data2

   names  marks  salary
0  vikas     50     100
1  akash     55     200
2  kaash     20     150
3  raash     30     105

In [15]:
data2['names']

0    vikas
1    akash
2    kaash
3    raash
Name: names, dtype: object

In [56]:
data2[['names','marks']]

   names  marks
0  vikas     50
1  akash     55
2  kaash     20
3  raash     30

# loc() & iloc()

## loc() slices the dataframe based on labels

In [20]:
data2.loc[:]

   names  marks  salary
0  vikas     50     100
1  akash     55     200
2  kaash     20     150
3  raash     30     105

In [32]:
data2.loc[2]

names     kaash
marks        20
salary      150
Name: 2, dtype: object

In [33]:
data2.loc[[2]]

   names  marks  salary
2  kaash     20     150

In [43]:
data2.loc[:,['names']]

   names
0  vikas
1  akash
2  kaash
3  raash

In [47]:
data2.loc[1:3,'names':'salary']

   names  marks  salary
1  akash     55     200
2  kaash     20     150
3  raash     30     105

## iloc() slices the dataframe based on digits

In [49]:
data2.iloc[0:3]

   names  marks  salary
0  vikas     50     100
1  akash     55     200
2  kaash     20     150

In [53]:
data2.iloc[0:3,[0,1]]

   names  marks
0  vikas     50
1  akash     55
2  kaash     20

In [54]:
data2.iloc[0:3,0:]

   names  marks  salary
0  vikas     50     100
1  akash     55     200
2  kaash     20     150

In [58]:
data2

   names  marks  salary
0  vikas     50     100
1  akash     55     200
2  kaash     20     150
3  raash     30     105

In [57]:
data2['marks']>20

0     True
1     True
2    False
3     True
Name: marks, dtype: bool

In [61]:
data2[data2['marks']>20]

   names  marks  salary
0  vikas     50     100
1  akash     55     200
3  raash     30     105